astro-build.astro-vscode
batisteo.vscode-django
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
ccagml.vscode-leetcode-problem-rating
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
davidanson.vscode-markdownlint
docker.docker
donjayamanne.githistory
donjayamanne.python-extension-pack
eamodio.gitlens
ecmel.vscode-html-css
eriklynd.json-tools
esbenp.prettier-vscode
evondev.indent-rainbow-palettes
flyfly6.terminal-in-status-bar
foxundermoon.shell-format
golang.go
htmlhint.vscode-htmlhint
huacnlee.autocorrect
humao.rest-client
igordvlpr.open-in-browser
jacking.go-runner-helper
kevinrose.vsc-python-indent
mdickin.markdown-shortcuts
mechatroner.rainbow-csv
metaseed.metajump
mhutchie.git-graph
mohd-akram.vscode-html-format
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.live-server
msjsdiag.vscode-react-native
n3rds-inc.time
naumovs.color-highlight
njpwerner.autodocstring
oderwat.indent-rainbow
pranaygp.vscode-css-peek
pucelle.vscode-css-navigation
quillaja.goasm
rid9.datetime
ritwickdey.liveserver
rvest.vs-code-prettier-eslint
shd101wyy.markdown-preview-enhanced
sinclair.react-developer-tools
skyran.js-jsx-snippets
streetsidesoftware.code-spell-checker
tooltitudeteam.tooltitude
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wakatime.vscode-wakatime
yokoe.vscode-postfix-go
yzane.markdown-pdf
yzhang.dictionary-completion
zeshuaro.vscode-python-poetry
zignd.html-css-class-completion
zsh.go-snippets
